[M_Orchid_Deserters MissionDefinition]
MissionDescription="Captain Scully doesn't take kindly to refugees. He tells you to kill them with the traps left."
TurnInDescription="Thanks to your efforts, the remaining members of Scarlett's group will have a small chance of finding more profitable work.."
